W6D5/ninety-nine-cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat&.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        debugger
        @cat = Cat.find_by(id: params[:id])
        if @cat&.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "black"], ["updated_at", "2022-09-16 23:57:48.093441"], ["id", 4]]