W7D2/music_app/app/views/bands/_band.html.erb

    <h3>Albums:</h3>
    <% band.albums.each do |album|%>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = ?  [["band_id", 1]]