W7D2/music_app/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_album
        @album = Album.find_by(id: params[:id])

INSERT INTO "albums" ("title", "year", "band_id", "studio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hiiii"], ["year", 1998], ["band_id", 1], ["studio", 1], ["created_at", "2022-09-20 23:56:30.993705"], ["updated_at", "2022-09-20 23:56:30.993705"]]
---
    def create
        @album = Album.new(album_params)
        # debugger
        if @album.save!