W7D2/music_app/app/controllers/bands_controller.rb

    def set_band
        @band = Band.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @band = Band.new(band_params)
        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "band"], ["created_at", "2022-09-20 21:04:55.031522"], ["updated_at", "2022-09-20 21:04:55.031522"]]

    def update
        if @band.update(band_params)
---
UPDATE "bands" SET "name" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["name", "bandd"], ["updated_at", "2022-09-20 21:51:27.090554"], ["id", 1]]

    def destroy
        @band.destroy
---
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 2]]