W7D2/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "test@mail.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-09-20 18:56:37.073552"], ["updated_at", "2022-09-20 18:56:37.073552"]]
---
    def create
        @user = User.new(user_params)
        if @user.save